Autodesk.Revit.DB.ExternalService.IExternalServerProxy.GetDescription
Implement this method to return a description of the server.
Remarks:
The purpose of this string is to describe the external server
in more details than just a short name alone could do.
The intended use is to show the string to the end user in UI
when UI is appropriate for the corresponding external service.
Beside the requirement for it to be a non-empty string,
there are no other general restrictions imposed by the External Services Framework.
However, the external service  may have some specific rules in place for its servers.
Returns:
Description of the server.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalServerProxy.GetVendorId
Implement this method to return the id of the vendor of the server.
Remarks:
The Id is expected to be a string consisting of 4 characters.
Returns:
Vendor Id of the server.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalServerProxy.GetName
Implement this method to return the name of the server.
Remarks:
Although a server is uniquely identified by its Id,
the Name can identify it to the end user in UI when UI
is appropriate for the corresponding external service.
Beside the requirement for the name to be a non-empty string,
there are no other general restrictions imposed by the External Services Framework.
However, the external service  may have some specific rules in place for its servers.
Returns:
Name of the server.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalServerProxy.GetServiceId
Implement this method to return the id of the service.
Remarks:
An external server belongs to only one external service.
This method must return an Id that matches the Id of the corresponding service was registered with.
Returns:
The id of the service to which the server belongs.
Since:
2013

Autodesk.Revit.DB.ExternalService.IExternalServerProxy.GetServerId
Implement this method to return the id of the server.
Remarks:
The Id must uniquely identify the external server
to the corresponding external service. It will be
an error when two servers with identical Ids try
to register for one external service.
Returns:
The id of the server.
Since:
2013